Revit 2027 API
SpecTypeId.Displacement Property
 Displacement/Deflection, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Displacement { get; }
Public Shared ReadOnly Property Displacement As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Displacement {
	ForgeTypeId^ get ();
}
static member Displacement : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace